Public Attributes | List of all members
API_SyTran Struct Reference
Element Manager API
Symbol transformation parameters. More...
#include <APIdefs_Elements.h>
 Public Attributes
API_Coord  | loc
The location of the referenced library part.
double  | angle
The rotation angle.
double  | xRatio
'x' scaling.
double  | yRatio
'y' scaling.
Detailed Description
Symbol transformation parameters.
Remarks
This data structure gives information on the transformation parameters of a plaved Library Part. The transformation chain is: placement, rotation, scaling; respectively. Scaling is done in the rotated coordinate system. Refer to the ACAPI_LibraryPart_GetSyTran function for more details.
Member Data Documentation
◆ angle
 API_SyTran::angle
The rotation angle.
◆ loc
 API_SyTran::loc
The location of the referenced library part.
◆ xRatio
 API_SyTran::xRatio
'x' scaling.
◆ yRatio
 API_SyTran::yRatio
'y' scaling.